evidence/reliability-operations/g3-k6-public-pay.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: evidence/reliability-operations/k6/g3-public-pay.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 3 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 1 VUs  00m01.0s/10m0s  0/3 shared iters

running (00m02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  33% ] 1 VUs  00m02.0s/10m0s  1/3 shared iters

running (00m03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  67% ] 1 VUs  00m03.0s/10m0s  2/3 shared iters


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.99' rate=100.00%

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 12      3.501839/s
    checks_succeeded...: 100.00% 12 out of 12
    checks_failed......: 0.00%   0 out of 12

    ✓ sale created
    ✓ pay accepted
    ✓ callback applied
    ✓ sale is paid

    HTTP
    http_req_duration..............: avg=250.2ms min=206.72ms med=235.55ms max=349.68ms p(90)=290.6ms p(95)=317.21ms
      { expected_response:true }...: avg=250.2ms min=206.72ms med=235.55ms max=349.68ms p(90)=290.6ms p(95)=317.21ms
    http_req_failed................: 0.00%  0 out of 12
    http_reqs......................: 12     3.501839/s

    EXECUTION
    iteration_duration.............: avg=1.14s   min=917.84ms med=958.78ms max=1.54s    p(90)=1.43s   p(95)=1.49s   
    iterations.....................: 3      0.87546/s
    vus............................: 1      min=1       max=1
    vus_max........................: 1      min=1       max=1

    NETWORK
    data_received..................: 12 kB  3.5 kB/s
    data_sent......................: 4.6 kB 1.4 kB/s



running (00m03.4s), 0/1 VUs, 3 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m03.4s/10m0s  3/3 shared iters